Repository: haltian/Thingsee-Toolbox
Catalog: lib/l10n/app_*.arb
Languages: fi

source: Remove stack?
fi: Poista stack?

source: Remove
fi: Poista

source: Cancel
fi: Peruuta

# areYouSureYouWantToDeleteStack
source: Are you sure you want to remove the stack from your account? The stack will remain available in the system.
fi: Oletko varma että haluat poistaa stackin käyttäjältä? Stack pysyy saatavilla järjestelmässä.

# clientID
source: Client ID: {id}
fi: Asiakastunnus: {id}

# path
source: Path: {path}
fi: Polku: {path}

source: Info
fi: Tiedot

# addNewStack
source: Add a new stack
fi: Lisää uusi stack

source: Stack added successfully
fi: Stackin lisäys onnistui

source: Stack deleted successfully
fi: Stack poistettu onnistuneesti

# youHaveNotTakenStacksToUse
source: You have not taken any Thingsee stacks into use.
fi: Et ole ottanut yhtään Thingsee stackiä käyttöön.

source: No results
fi: Ei tuloksia

source: Filter
fi: Rajaus

# errorOccured
source: An Error occurred
fi: Virhe tapahtui

source: Error:
fi: Virhe:

# problemConnectingToServers
source: Problem connecting to the server
fi: Virhe yhdistäessä palvelimille

source: Something went wrong
fi: Jokin meni pieleen

source: Edit
fi: Muokkaa

# envProduction
source: pr - Production
fi: pr - Tuotanto

# envDevelopment
source: rd - Development
fi: rd - Kehitys

# envUnassigned
source: un - Unassigned
fi: un - Määrittelemätön

source: Environment
fi: Ympäristö

source: Select environment
fi: Valitse ympäristö

source: Country
fi: Maa

source: Select country
fi: Valitse maa

source: Search
fi: Etsi

source: Name
fi: Nimi

source: Enter group name
fi: Syötä ryhmän nimi

source: Description
fi: Kuvaus

source: Enter group description
fi: Syötä ryhmän kuvaus

# environmentNameWillBe
source: The name of the deployment group will be
fi: Laiteryhmän nimi tulee olemaan

source: Add group
fi: Lisää ryhmä

source: Add new deployment group
fi: Lisää uusi laiteryhmä

source: Group created successfully
fi: Ryhmä luotiin onnistuneesti

source: Group deleted successfully
fi: Ryhmä poistettiin onnistuneesti

# areYouSureYouWantToDeleteGroup
source: Are you sure you want to remove the deployment group? All devices assigned to this group will be moved to “Unassigned”.
fi: Oletko varma että haluat poistaa tämän laiteryhmän? Kaikki tämän ryhmän laitteet siirretään ryhmään “Unassigned”.

source: Remove deployment group?
fi: Poista laiteryhmä?

# thereAreNoDeploymentGroups
source: There are no deployment groups in this stack.
fi: Tässä stackissä ei ole yhtään laiteryhmää.

# addNewGroup
source: Add new stack
fi: Lisää uusi ryhmä

# thereAreNoDevices
source: There are no devices in this deployment group.
fi: Tässä ryhmässä ei ole yhtään laitetta.

source: Add new device
fi: Lisää uusi laite

source: Device info
fi: Laitteen tiedot

# welcomeToThingseeInstaller
source: Welcome to Thingsee Toolbox! Start by entering the details of the Thingsee stack you are going to use.
fi: Tervetuloa käyttämään Thingsee Toolboxia! Aloita syöttämällä stackin tiedot.

source: Edit deployment group
fi: Muokkaa laiteryhmää

source: Save changes
fi: Tallenna muutokset

source: Edit device
fi: Muokkaa laitetta

source: Installed
fi: Asennettu

# newInstallation
source: New
fi: Uusi

source: Quarantine
fi: Karanteenissa

source: Retired
fi: Poistettu käytöstä

source: Uninstalled
fi: Asentamaton

source: Installation status
fi: Asennuksen tila

source: Visitor counter
fi: Vierailija laskuri

source: Occupancy
fi: Läsnäolo

source: Event-based
fi: Tapahtumaan perustuva

# locationIn
source: In
fi: Sisällä

# locationOut
source: Out
fi: Ulkona

# defaultMode
source: Default
fi: Oletus

source: Fixed interval
fi: Muuttumaton aikaväli

source: Operating mode
fi: Toimintatila

source: Disabled
fi: Pois käytöstä

source: Save
fi: Tallenna

source: Orientation
fi: Suunta

# mumModeAccelerometer
source: MUM mode{newline}(accelerometer)
fi: MUM-tila{newline}(kiihtyvyysanturi)

source: Installation location
fi: Asennuspaikka

source: Deployment group
fi: Laiteryhmä

source: Replace device
fi: Korvaa laite

source: Read QR-code
fi: Lue QR-koodi

# hallModeMagneticSensor
source: Hall mode{newline}(magnetic{newline}sensor)
fi: Hall-tila{newline}(magneettinen{newline}anturi)

source: Replace
fi: Korvaa

source: Device added successfully
fi: Laite lisättiin onnistuneesti

source: Device deleted successfully
fi: Laite poistettiin onnistuneesti

# sameDevice
source: Same device. Please read the QR code from the device that replaces the current one.
fi: Sama laite. Ole hyvä ja lue QR koodi laitteesta joka korvaa tämän laitteen.

# unknownQRcode
source: Unknown QR code! Please make sure that only one code is being read at a time
fi: Tuntematon QR kood! Varmista, että luet vain yhden QR-koodin kerrallaan

# cameraPermissionNotGranted
source: You didn't provide permission to access the camera.
fi: Et ole antanut lupaa käyttää kameraa.

# areYouSureYouWantToDeleteDevice
source: Are you sure you want to remove the device? It will be moved to “Unassigned”
fi: Oletko varma että haluat poistaa laitteen? Se siirretään “Unassigned” ryhmään.

source: Remove device
fi: Poista laite

source: Device replaced successfully
fi: Laite korvattiin onnistuneesti

source: Original device
fi: Alkuperäinen laite

source: Replace with
fi: Korvaa laitteella

source: Device status
fi: Laiteen tila

source: Online
fi: Päällä

# offlineLastSeen
source: Offline, last seen: {offline}
fi: Pois päältä, viimeksi verkossa: {offline}

source: Battery level
fi: Paristo

# deviceEvents
source: Events
fi: Viestit

# deviceUpdated
source: Device information updated successfully
fi: Laitteen tiedot päivitetty onnistuneesti

# vibration
source: Vibration: {activityLevel} Energy: {energyLevel}
fi: Tärinä: {activityLevel} Energia: {energyLevel}

# accConfig
source: Accelerometer sensor configuration
fi: Kiihtyvysmittaus konfiguraatio

# systemInfo
source: Thing system information data
fi: Järjestelmä data

# infoRequest
source: Thing information request
fi: Järjestelmä informaatio pyyntö

# infoRequestUnv
source: Thing information unavailable
fi: Informaatiota ei ole saatavilla

# weatherInfoAirp
source: Air pressure: {airp} hPa
fi: Ilmanpaine: {airp} hPa

# weatherInfoHumd
source: Humidity: {humd}%
fi: Ilmankosteus: {humd}%

# weatherInfoTemp
source: Temperature: {temp}°C
fi: Lämpötila: {temp}°C

# weatherInfoLght
source: Light: {lght} lux
fi: Valoisuus: {lght} lux

# magnetoInfo
source: Hall: {hall} Hall count: {hallCount}
fi: Magneetti: {hall} Muutokset: {hallCount}

# leakageResistance
source: Leakage resistance: {res}
fi: Vuoto resistanssi: {res}

# sensorConfig
source: Sensor configuration message: {tsmId}
fi: Sensorin konfiguraatio viesti: {tsmId}

# batteryInfo
source: Battery message
fi: Paristodata info

source: Devices
fi: Laitteet

source: Logs
fi: Lokit

source: More
fi: Lisää

source: Ping
fi: Yhteyskokeilu

# moveCount
source: Move count: {moveCount}
fi: Liike määrä: {moveCount}

# count
source: Count: {count}
fi: Määrä: {count}

source: Heartbeat
fi: Syke

# gatewayMessage
source: Gateway message: {gatewayMessage}
fi: Tukiaseman viesti: {gatewayMessage}

# edgeCoreChange
source: Edge core state change
fi: Edge core tilan muutos

# edgeCoreStats
source: Edge core stats diagnostics data event request
fi: Edge core statistiikan diagnostiikkan pyyntö

# edgeCoreBinary
source: Edge core binary event
fi: Edge core binääri tapahtuma

# jamDetection
source: Jam detection message
fi: Tukos tunnistus info

# angle
source: Angle: {angle}°
fi: Kulma: {angle}°

# temperature
source: Temperature: {temperature}°C
fi: Lämpötila: {temperature}°C

# distance
source: Distance: {dist} mm
fi: Etäisyys: {dist} mm

# beamInfo
source: Distance: {dist} mm
fi: Etäisyys: {dist} mm

# beam2d
source: Beam 2D area information
fi: Beam 2D alue

# ledControl
source: LED control request
fi: LED kontrolli pyyntö

# noBattery
source: No battery data available
fi: Paristo dataa ei ole saatavilla

# neighbouringData
source: Sensor network neighbouring data RSSI:{rssi}
fi: Sensoriverkon data RSSI:{rssi}

source: Help
fi: Ohje

# goToHelp
source: Go to Haltian support center
fi: Siirry Haltian support sivulle

source: Licenses
fi: Lisenssit

# goToLicenses
source: Used by this application
fi: Käytössä tässä sovelluksessa

# version
source: Version: {version}
fi: Versio: {version}

# copyright
source: Copyright {year} Haltian
fi: Tekijänoikeus {year} Haltian

# export
source: Export csv
fi: Luo csv

source: Stop recording
fi: Lopeta tallennus

source: Start recording
fi: Aloita tallennus

source: Delete log file?
fi: Poista lokitiedosto?

# areYouSureDeleteLogFile
source: Are you sure you want to remove the log file?
fi: Oletko varma että haluat poistaa lokitiedoston?

source: Recording on
fi: Tallennus päällä

source: Recording off
fi: Tallennus pois päältä

source: Log file deleted
fi: Lokitiedosto poistettu

source: No events in this log file
fi: Tässä lokissa ei ole tapahtumia

source: Adding a device
fi: Laitteen lisääminen

source: Replacing a device
fi: Laitteen korvaaminen

source: Editing a device
fi: Laitteen muokkaaminen

source: Removing a device
fi: Laitteen poistaminen

source: Device added
fi: Laite lisätty

source: Device replaced
fi: Laite korvattu

source: Device edited
fi: Laitetta muokattu

source: Device removed
fi: Laite poistettu

source: Title
fi: Otsikko

source: Enter title
fi: Syötä otsikko

source: Enter description
fi: Syötä kuvaus

source: Events included in the log:
fi: Lokiin sisältyvät tapahtumat:

source: Add new log file
fi: Lisää uusi lokitiedosto

source: Edit log file
fi: Muokkaa lokitiedostoa

source: Add log
fi: Lisää loki

source: Delete log entry
fi: Poista lokimerkintä

source: Remove log entry?
fi: Poista lokimerkintä?

# areYouSureDeleteLogEntry
source: Are you sure you want to remove this log entry?
fi: Oletko varma että haluat poistaa tämän lokimerkinnän?

source: Device
fi: Laite

source: Note
fi: Viesti

source: Old device
fi: Vanha laite

source: Installation notes
fi: Asennus viesti

source: Log entry deleted
fi: Lokimerkintä poistettu

# thisNoteIsStoredInYourDevice
source: This note is stored in your device and will only be shown in the log.
fi: Tämä viesti tallennetaan laitteeseesi ja on vain näkyvissä lokissa.

source: New device
fi: Uusi laite

source: Offline
fi: Pois päältä

# carbonConfig
source: Carbon Dioxide configure
fi: Hiilidioksidien konfiguraatio

# carbonManual
source: Carbon Dioxide manual calibrate
fi: Hiilidioksidi tasojen manuaalinen kalibrointi

# tvocConfig
source: TVOC configure
fi: Haihtuvat orgaaniset yhdisteiden konfiguraatio

# carbonHardware
source: Carbon Dioxide read hardware component versions
fi: Hiilidioksidi antureiden komponentti versiot

source: TVOC Reset
fi: Haihtuvat orgaaniset yhdiste resetointi

# countInOut
source: In: {countIn} Out: {out}
fi: Sisään: {countIn} Ulos: {out}

source: Group
fi: Ryhmä

source: No logs added
fi: Ei lokeja

source: Enter TUID
fi: Syötä TUID

# batl
source: Battery Level: {batl} %
fi: Paristo taso: {batl} %

# orientationMsg
source: Orientation - x: {accx} - y: {accy} - z: {accz}
fi: Suunta - x: {accx} - y: {accy} - z: {accz}

# cellularInfoOperator
source: Operator: {operatorName}
fi: Operaattori: {operatorName}

# systemMessage
source: System message: {msgId}
fi: Järjestelmäviesti: {msgId}

# occupancyMode
source: State: {state}
fi: Tila: {state}

source: Exporting CSV failed
fi: CSV:n luominen epäonnistui

# csvSavedToDownloadsFolder
source: CSV saved in the 'Downloads'-folder
fi: CSV tallennettu 'lataukset' kansioon

# enterTuidOrReadQR
source: Enter TUID or read QR code
fi: Syötä TUID tai lue QR-koodi

source: Firmware version
fi: Laiteohjelmisto versio

source: Log file updated
fi: Lokitiedosto päivitetty

# deviceNotFound
source: Device not found in the active stack
fi: Laitetta ei löytynyt aktiivisesta stackistä

source: Network disconnected
fi: Verkkoyhteys katkennut

source: Network connected
fi: Verkko yhdistetty

# wirepassNode
source: Wirepas node message
fi: Wirepas noodi viesti

source: USB-powered
fi: USB-virtajohto

source: Never
fi: Ei ikinä

# powerCoverMessage
source: Power cover information USB-Power: {usbpwr}
fi: Power cover USB-kytketty: {usbpwr}

source: Yes
fi: Kyllä

source: No
fi: Ei

source: Adding stack failed
fi: Stackin lisäys epäonnistui

source: Stack already exists
fi: Stack on jo olemassa

source: Client details
fi: Asiakastiedot

source: Secret
fi: Salasana

# pathTitle
source: Path
fi: Polku

# acceloremeter
source: MUM mode
fi: MUM-tila

source: Hall mode
fi: Hall-tila

source: Select group
fi: Valitse ryhmä

source: CSV saved
fi: CSV tallennettu

source: Thingsee stack
fi: Thingsee pino

# replacementDeviceCantBeDifferentType
source: The replacement device cannot be a different device type
fi: Korvaava laite ei voi olla eri laitetyyppiä

source: Enabled
fi: Käytössä

# amountIn
source: Inside: {amountIn}
fi: Sisällä: {amountIn}

# testMode
source: Test mode, please update device's configuration
fi: Testaustila, ole hyvä ja vaihda toimintatila
